app/views/api/recipes/show.json.jbuilder

json.ingredients do
    @recipe.ingredients.each do |ingredient|
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 30]]