app/controllers/api/recipes_controller.rb

    def index
        if params[:query]
            search_results = []
            recipes = Recipe.where("recipes.title ILIKE :query", query: "%#{params[:query]}%")
            search_results += recipes

            courses = Course.where("courses.course ILIKE :query", query: "%#{params[:query]}%")
            courses.each do |course|
                search_results += course.recipes
            end

            cuisines = Cuisine.where("cuisines.cuisine ILIKE :query", query: "%#{params[:query]}%")
            cuisines.each do |cuisine|
                search_results += cuisine.recipes
            end

            ingredients = Ingredient.where("ingredients.ingredient ILIKE :query", query: "%#{params[:query]}%")
---
SELECT "ingredients"."id" FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 31]]

        #     # @recipes = Recipe.all

        else
            @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

    def show
        @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]