app/controllers/api/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @recipe = Recipe.find(params[:id])