app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "display_name", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nikki@nommly.com"], ["LIMIT", 1]]
---
    def show
        @user = User.find_by(email: params[:email])