app/models/user.rb

    def self.find_by_credentials(email, password)
        @user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nikki@nommly.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zFq43SIYR9oMDF-BjWSzcA"], ["updated_at", "2020-07-28 14:34:40.273711"], ["id", 1]]